blog.org
#+HUGO_BASE_DIR: .
#+STARTUP: content
#+AUTHOR: Jean-Loup Adde
#+HUGO_AUTO_SET_LASTMOD: t

*** Building profitable investments with crypto-trading   :crypto:investment:
    :PROPERTIES:
    :EXPORT_DATE: 04-09-2020
    :EXPORT_FILE_NAME: investment-crypto-trading.en.md
    :END:

    An unusual post regarding crypto-trading and how to turn it into a profitable saving account. I am clearly not a trader and you have to be smart how much money you'll want to invest as there's fuck tons risks (consider this money lost). If there were alternatives to build a descent resource of income from "stationary" money I would highly recommend to use banks products but it's clearly a joke.
    DISCLAIMER: I haven't worked on an exchange itself and never studied trading theories in the past so please take those "tips" with parcymony.

**** Set your goals and limits

     Before going into the details, you need to be clear with yourself what you want out of it. If not, you'll be easily distracted or, even worst, addicted of how easy it is to make and loose money. Do you want to use crypto to own a currency that has the potential to revolution how we transact and share assets? Do you want to use it to make profits out of your "sitted" money? Or just being curious?

     Banks use to evaluate your profile in function of how you would interact with your money. For instance, pick between two graphs where High revenue but high risks or low returns but low risks of loosing your money. I would highly recommend thinking about this first to know which profile you are and act in function of it. If you know you're a player and adventuruous with money, setting a maximum treshold of money to invest into this can be a good starting point to avoid loosing too much. I think I'll never repeat enough that this sector is high risk for your money so if you're short, please, don't think of doing this.

     For instance, personally, I need massive marges to feel myself safe. So I've set the max I will invest to something relatively low like 10% of my savings. Cryptos are fluctuating so badly, you never know if it's gonna reach the stars or the ground. Let's learn from Icarus mistakes and be sensible.

     Second point, once you know how much you want to invest, how much do you want out of it? Personally, as I don't own anything, no morgage, no student load, I saw my savings growing slowly. Even if the UK has ISAs, never saw the point of setting one. You gonna lock so much money for barely a three figure return (when banks probably will make 4 or 5 out of your money). Anyway, all I wanted to say is that I wanted to make my money "grow" with rates more attractive than banks (10 / 20% would be amazing). Weirdly it gets easier to make money when you already have money /sigh/.

**** Getting started

     Crypto trading is clearly intimidating and it's easy to get fucked. Having worked in the industry, all the hosted solution is just a joke. They gonna abuse of the services they'll give to you without extreme quality. So I would recommend getting a physical (maybe it's a scam as well, I don't even know anymore) crypto wallet like a ledger or any competitor to store the crypto you'll buy.

     Second point is to set an account on one of the exchange. You'll have to get out of your confort zone and use proper trader tools to avoid paying **HUGE** fees. In the past, my mistake was to not dare having a try on the "pro" tools and use simplified products which had insane fees and a convertion rate advantaging the company. So please don't make the same mistake as me. I personally use coinbase.pro but you could go with kraken which has a pretty good reputation as well.

     Once that's picked up, how the hell is this working?

**** Welcome to the ~fight~ exchange

     Just imagine a place where everyone will fight to get the best prices and deals out of people like you and me getting fucked pretty hard by loosing all our savings. Welcome to the exchange. So you'll clearly never make as much money as the algorithm running on the platform making trades at the nanosecond :salt: but the idea is not too make a lot of trades but good ones.

     One point to start and understand the exchange. I'll talk mainly reusing the coinbase terms but I believe they are pretty standard in the industry.

***** Buying and selling

******  Market
       That's where you have the highest chance to buy and sell your assets. The exchange will create an "order" of the number of asset you want to buy or sells according to the market price. Let's call it a synchronous transaction.

******* Pros
        - Get your assets quickly
        - Easy to setup
******* Cons
        - Can be disavantageous in function of the trends

******  Limit
       The one I am using the most. This one will allow you to create orders for a specific amount and rate. For example, you see that the value of the Bitcoin is going up. You can set the value you would like to sell your assets and the orders will get "filled" once that condition is reached. Same thing for buying. "I'll only buy xBTC if it's y£", you can set this "x y" transaction now and wait peacefully that happens. Of course you need to be reasonable. Me too I would love 100BTC at 1£/BTC but let's be sensible. Well maybe that'll be possible if it crashes some day.

****** TODO the last one

*****  Analyzing
      So you need to know that exchanges are massively popuplated of trading bots and you'll probably never get as much money as they are producing. I was planning to build one but I don't think I am smart enough to make one producing money... As we are speaking of returns over a year, we can clearly take advantages of the fluctuation of the crypto currencies. I tend to do only 2 or 3 transactions per year on the exchange based on the tendancy of the currency.

****** Trend
       All we need to do is to follow the trend of the crypto. For instance, right now the value of 1BTC is 8800£ or something. According to historic data of the BTC, that's pretty high. So a good time to sell. We can still invest really low amount of money over our total to build up our portfolio but it's still pretty risky.

       To follow the trend according to our expectation, it's easy to configure the graph to look like something we can use to build up our analysis. We just need to pick a good grouping "time range" in my case 1h or 3h is fine. You see a global trend of the currency which should be enough to tell you if it's time to invest or not.

       If you don't feel confident enough, you can install a simple crypto currency ticker and simulate trades in your head (actually maybe I could build a sofware to help you out with that). That'll help you see if you're "catching" the trends properly or not. That's what I do personally. I just check the price of the BTC every morning and get on with my life. You could be more serious and follow news, etc... but I've never seen the point as most of it is biaised by shit posts and paid articles. Just stick to numbers, they speak the truth.

**** Applying it

     So after all of this, to apply it should not be too difficult. Once you've set goals, understood how exchanges works and how / when to use the right trade, you just need to be able to catch the trend of the cryptocurrency to make the best trades. It is pretty tricky if you go for daily trades but to be honest, you'll be better to catch longer trends and make big trades rather than more and smaller ones which will be error prone.

     For instance, I can wait 3-6 months for the BTC prices to go down to start buying some and wait for a long time for it to go up to sell it back. Of course, I did sell or buy it too early sometimes but still made profit at the end as what I made out of it was what I hoped for.

**** Conclusion

     Applying that technic is clearly not the most difficult. It's mainly a daily check on the trend of one crypto currency that made me make some descent money out of my saving without risking too much. Once you understand the trend and what is a good "rate" for investing and selling, it gets fairly abordable to make money out of the industry. Will it continue? I clearly don't think so but if we can make something out it, why not?

